[
  {
    "author": "J.W.",
    "review": "“I had seen 3 specialists for severe hip/groin pain that would go numb. I was in pain 95% of the time. All of the other doctors said it was arthritis and that I had to learn to live with the pain. I cried for a day and a half. I was not ready to give up my active life at 51 years old. In desperation, I went to see Dr. Palamone. After only 9 visits I can stand up straight and walk without pain for the first time in a year. It’s a miracle and my life is back to normal.”"
  },
  {
    "author": "D.A.",
    "review": "“I had seen 3 specialists for severe hip/groin pain that would go numb. I was in pain 95% of the time. All of the other doctors said it was arthritis and that I had to learn to live with the pain. I cried for a day and a half. I was not ready to give up my active life at 51 years old. In desperation, I went to see Dr. Palamone. After only 9 visits I can stand up straight and walk without pain for the first time in a year. It’s a miracle and my life is back to normal.”"
  },
  {
    "author": "R.R.",
    "review": "“My son had neck pain which continued down his side into his leg along with sinus problems and digestive disturbances. These problems caused John to be tired, with abdominal pain and diarrhea which caused him to stay home. After seeing two different specialists with no luck we came to see Dr. Mike. After a few weeks of treatment, John’s abdominal pain and diarrhea has subsided and has much more energy. John’s complexion and dark circles around his eyes have disappeared. He is sleeping much more soundly with less allergy and sinus problems. The results of these treatments were quicker than expected. Dr. Mike and his staff are excellent and always upbeat.”"
  },
  {
    "author": "C.R.",
    "review": "“This is my second experience with shingles in 2 years and the laser treatment has been a drastic change for me. Before I had no desire to leave my home or mingle with friends. I had no energy to partake in any physical sports or activities. Now all of my symptoms have been relieved and am able to function and move. I also had burning and dull pain in my low back which is also relieved.”"
  },
  {
    "author": "E.V.",
    "review": "“I have had Jacksonian epilepsy all my life. Often, I may have up to five or six seizures in a single evening after dinner and before bedtime. For the last couples of years this has been the case reaching a distressing peak of about a dozen seizures per day. I originally came to Forest Hills Chiropractic for the loss of feeling and wrist pain in my right hand. Surprisingly, I noticed that the adjustments and treatments for the nerve problem that I received had a marked effect on the frequency of Jacksonian seizures. In the last couple of months, I have only had two or three episodes of multiple seizures in one day and have gone as long as 10 days without a seizure. I feel I must give credit where credit is due. Thank you for all your help!”"
  },
  {
    "author": "K.B.",
    "review": "“I came into the office with complaints for soreness, weakness and numbness in both hands and wrists. I had never had this looked at but since my mother had carpal tunnel syndrome and my symptoms were the same, I assumed that I had carpal tunnel syndrome also. I was never a believer in chiropractic, but my whole attitude has changed for the better. I realized I did not have carpal tunnel syndrom , but a pinched nerve in my neck that was making my hands go numb. I never thought something in my neck would cause my hand pain. Coming to the chiropractor has worked wonders for me! I cannot say enough about Dr. Palamone and his staff. Everyone is pleasant, down to earth and very personable. They treat you like a part of their own family. If you never thought about going to the chiropractor before, don’t hesitate. Run, don’t walk!”"
  },
  {
    "author": "M.N.",
    "review": "“I had back pain that set me back for 3 years not being able to do the normal things I do now. I couldn’t clean my house or help with yard work. Chiropractic care had given me back my life. I can once again enjoy going out with my husband and son. I tell everyone about Dr. Palamone.”"
  },
  {
    "author": "A.M.",
    "review": "“I am a teacher who was having trouble standing at the blackboard because of the pain. Chiropractic has taken away my pain leaving me with more energy. I noiw am pain free with no movement problems.”"
  }
]
